IDENTIFICATION DIVISION.
PROGRAM-ID. SomaSimples.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMERO-1         PIC 9(5) VALUE 0.
01 NUMERO-2         PIC 9(5) VALUE 0.
01 RESULTADO        PIC 9(5) VALUE 0.

PROCEDURE DIVISION.
INICIO.
    DISPLAY "Digite o primeiro número: " WITH NO ADVANCING.
    ACCEPT NUMERO-1.
    DISPLAY "Digite o segundo número: " WITH NO ADVANCING.
    ACCEPT NUMERO-2.

    COMPUTE RESULTADO = NUMERO-1 + NUMERO-2.

    DISPLAY "O resultado da soma é: " RESULTADO.

    STOP RUN.
